# Модуль импорта изделий с привязкой к контрактам

## Описание

Модуль `products_contracts_import.py` предназначен для импорта изделий и контрактов из CSV файлов, полученных из оборотно-сальдовой ведомости по счету 002 (материалы).

## Возможности

- Автоматическое извлечение информации об изделиях (двигатели) из CSV
- Парсинг контрактов и договоров
- Связывание изделий с соответствующими контрактами
- Создание контрактов "Без контракта" для изделий без привязки
- Поддержка прогресс-бара для длительных операций

## Формат входных данных

Модуль анализирует CSV файлы с разделителем `;` и автоматически извлекает:

### Изделия
- **Наименование**: Полное название изделия (например, "Двигатель В-46-2С1")
- **Номер**: Уникальный номер изделия (например, "2Ж11АТ1789")

### Контракты
- **Наименование**: Название контракта (например, "ГРАНИТ (2024)")
- **Номер**: Номер договора (например, "2224187909991442245221303")
- **Исполнитель**: Организация-исполнитель (например, "РПТП ГРАНИТ АО")
- **Дата**: Дата договора (формат ДД.ММ.ГГГГ или ДД.ММ)

## Алгоритм работы

1. **Парсинг CSV**: Чтение файла построчно с анализом содержимого
2. **Извлечение данных**: Поиск строк с ключевыми словами:
   - "Двигатель" + "№" → изделие
   - "ООО"/"АО"/"ОАО"/"ЗАО" → контрагент
   - "Договор" → договор
   - Дата в формате ДД.ММ.ГГГГ → дата договора
3. **Связывание**: Группировка данных по изделиям и контрактам
4. **Импорт в БД**: Сначала контракты, затем изделия с привязкой

## Использование

### В коде

```python
from import_export.products_contracts_import import import_products_from_contracts_csv

# Импорт с отображением прогресса
def progress_callback(step, total, note):
    print(f"Прогресс: {step}/{total} - {note}")

result = import_products_from_contracts_csv("path/to/file.csv", progress_callback)
print(f"Импортировано: {result['products']} изделий, {result['contracts']} контрактов")
```

### В интерфейсе

1. Откройте "Настройки" → "Импорт/Экспорт"
2. Нажмите кнопку "Импорт изделий с контрактами"
3. Выберите CSV файл
4. Дождитесь завершения импорта

## Создание шаблона

```python
from import_export.products_contracts_import import generate_products_contracts_template

template_path = generate_products_contracts_template("template.csv")
```

## Структура выходных данных

### Контракты
- `code`: Номер договора или системный код
- `name`: Наименование контракта
- `contract_type`: "Договор" (по умолчанию)
- `executor`: Организация-исполнитель
- `start_date`: Дата договора
- `description`: Автоматически генерируется

### Изделия
- `name`: Наименование изделия
- `product_no`: Номер изделия
- `contract_id`: Ссылка на контракт в БД

## Обработка ошибок

- Автоматическое создание контракта "Без контракта" для изделий без привязки
- Логирование ошибок импорта с детализацией
- Продолжение работы при частичных ошибках

## Требования

- База данных с таблицами `contracts` и `products`
- Поддержка расширенных полей контрактов (name, contract_type, executor, etc.)
- Связь `products.contract_id` → `contracts.id`

## Примеры входных данных

```
"Двигатель В-46-2С1 № 2Ж11АТ1789";"РПТП ГРАНИТ АО";"Договор №2224187909991442245221303 ГРАНИТ (2024)";"04.07.2024"
"Двигатель В-46 № Е06АТ7397";"ОВК ООО";"Договор № 2325187913551442245231239/23 (ОВК 2024)";"14.08.2023"
```

## Ограничения

- Требует наличия ключевых слов в тексте для корректного парсинга
- Даты должны быть в формате ДД.ММ.ГГГГ или ДД.ММ
- Номера изделий должны содержать символ "№"
- Контракты должны содержать слово "Договор" или номер
